Revit 2024 API
ParameterUtils.GetAllBuiltInGroups Method
 Gets the identifiers of all built-in parameter groups.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public static IList<ForgeTypeId> GetAllBuiltInGroups()
Visual Basic
Public Shared Function GetAllBuiltInGroups As IList(Of ForgeTypeId)
Visual C++
public:
static IList<ForgeTypeId^>^ GetAllBuiltInGroups()
Return Value
 The built-in group identifiers.
See Also
ParameterUtils Class
Autodesk.Revit.DB Namespace